Revit 2027 API
BuiltInFailures.ElectricalFailures.NotEnoughAvailSlotsForConnectionChange Property
 You can't change the connection type to Breakers connect to panel [Panel Name] because there aren't enough slots. \nYou can increase the [ParameterName] to be greater than [Number] to connect through breaker slots or open the panel schedule and manually reshuffle non - consecutive slots.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotEnoughAvailSlotsForConnectionChange { get; }
Public Shared ReadOnly Property NotEnoughAvailSlotsForConnectionChange As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotEnoughAvailSlotsForConnectionChange {
	FailureDefinitionId^ get ();
}
static member NotEnoughAvailSlotsForConnectionChange : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace